{"Player": {"x_loc": 2, "y_loc": 4}, "World": {"y_dim": 5, "x_dim": 3}, "Room": {"description": ["You are in the bridge of your crashed ship. Find a way out of here! It seems like the only way to go is north, out the door.", "Upon closer inspection of your ship, two important pieces, ththe Chuchumexion and the Warp Coil, are missing. They likely fell somewhere close in the crash!", "You are at the base of a tall, old tree. You can see a long length of rope hanging from a branch.", "From here you can see many things about the landscape. A mountain is to your southeast, and a shack appears due east as well.", "A dank, murky swamp. You can almost feel someone yelling at you to get out of it.", "An overwhelmingly large mountain stands in front of you. Some rope that seems to be the remains of a climber's gear has been thrown in a heap at the base of the mountain.", "A large, empty valley stands at the base of a large mountain to the south. It's a very impressive view.", "The decaying ruins of a once-grand building stands in front of you. The entrance is sealed by a large chunk of rock. Next to the building is a well that, upon closer inspection, has something glittering in the bottom. Maybe you can find something to pull it out...", "You see a small shack to your east. To your north is what appears to be a hill.", "From the top of this hill, you can see far in all directions. What appears to be a large group of ruins can be seen due south.", "A very warm and dry desert. You can see a lot of cacti, but  none of your ship's pieces.", "A massive group of cacti appears as if to welcome you to the desert. It's almost picturesque in a way.", "While walking through a dense forest, you can see what appears to be an old abandoned shack just north of you.", "You are at the door of the shack. A sign is posted on it saying \"0118 999 881 999 119 7253\". Use \"north\" to enter the shack.", "You see a large hole in the roof with sunlight pouring into it. On the ground lying in rubble is the Chuchumexion. However, it is inside some sort of glass case with multiple wires connected to it. The wires all connect to what appears to be a toaster. However, instead of two holes for bread, there are just three small holes in a line. Maybe you can find something to unlock it with?"], "name": ["SPACESHIP", "OUTSIDE THE SHIP", "TALL TREE: BASE", "IN THE TALL TREE", "SWAMP", "MOUNTAIN", "VALLEY", "RUINS", "EMPTY AREA", "HILL", "DESERT", "CACTUS FIELD", "FOREST", "MYSTERIOUS SHACK", "INSIDE THE SHACK"]}, "Items": {"loc_des": [], "x_loc": [], "name": [], "description": [], "y_loc": []}}
